#for loop - ის დახმარებით, 126 - დან, 0 - მდე, საპირისპირო მიმართულებით გამოიტანეთ რიცხვები, ჯერ 1 ნაბიჯით, შემდეგ 2 ნაბიჯით და შემდეგ 3 ნაბიჯით.(126, 125, 124 და ა.შ)

for i in range(126, -1, -1):
    print(i)

#for loop - ის დახმარებით 1 - დან 47 - მდე გამოიტანეთ რიცხვების ჯამი, გამოიყენეთ ( + )ოპერატორი, ხოლო შემდეგ განახორციელეთ იგივე რამ, ( * ) - ოპერატორზე.

for i in range(1 , 47):
    print("1 + ", i, "=", 1 + i)

for i in range(1, 46):
    print("1 * ", i, "=", 1 + i)

#while loop  - ის დახმარებით, დაითვალეთ რიცხვი 100 - დან 1 - მდე.

x = 1 
y = 101
while 100 >= x:
    x += 1
    y -= 1
    print(y)

    
